InformationRegisters/ПроверкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПроверкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРезультатаПроверкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кластеры1С</v8:Type>
						<v8:Type>cfg:CatalogRef.СерверыБД</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВебСерверы</v8:Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Кластеры1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Кластеры1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательЦентральногоСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольЦентральногоСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКластера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Защищен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеСерверыКластера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРабочегоСервера</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПроверкаСостоянияОбъектов/Ext/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

// Проверить актуальность зарегистрированных баз.
// 
// Параметры:
//  Кластер - СправочникСсылка.Кластеры1С
//  ИдентификаторыБаз - УникальныйИдентификатор
Процедура ПроверитьАктуальностьЗарегистрированныхБаз(Кластер, ИдентификаторыБаз) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза
						|ИЗ
						|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
						|ГДЕ
						|	НЕ ИнформационныеБазы.ИдентификаторБазы В (&ИдентификаторыБаз)
						|	И ИнформационныеБазы.Владелец = &Кластер1С";
	
	Запрос.УстановитьПараметр("Кластер1С",				Кластер);
	Запрос.УстановитьПараметр("ИдентификаторыБаз",	ИдентификаторыБаз);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Правило = Справочники.ПравилаПроверкиОбъектов.РегистрацияИнформационнойБазы;
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьРезультатПроверки(Выборка.ИнформационнаяБаза, Правило);		
	КонецЦикла;
		
КонецПроцедуры

// Проверить доступность серверов.
Процедура ПроверитьДоступностьСерверов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	Кластеры1С.Ссылка КАК Кластер1С,
						|	Кластеры1С.АдресСервераАдминистрирования КАК АдресСервераАдминистрирования,
						|	Кластеры1С.ПортСервераАдминистрирования КАК ПортСервераАдминистрирования
						|ИЗ
						|	Справочник.Кластеры1С КАК Кластеры1С
						|ГДЕ
						|	Кластеры1С.Активен";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	Правило = Справочники.ПравилаПроверкиОбъектов.ДоступностьСервераАдминистрированияКластера;		
		
	Пока Выборка.Следующий() Цикл
		Попытка
			АгентАдминистрирования = Новый АдминистрированиеСервера(Выборка.АдресСервераАдминистрирования,
														Выборка.ПортСервераАдминистрирования);
			ПроверитьАвторизациюСервераАдминистрирования(АгентАдминистрирования);	
		Исключение
			ЗаписатьРезультатПроверки(Выборка.Кластер1С, Правило);	
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьАвторизациюСервераАдминистрирования(АгентАдминистрирования) 
	//TODO: Реализация
КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


// Записать результат проверки.
// 
// Параметры:
//  ОбъектКластера - СправочникСсылка.ИнформационныеБазы,
//			 - СправочникСсылка.Кластеры1С,
//  		 - 	СправочникСсылка.СерверыБД,
//  		 - 	СправочникСсылка.ПользователиИБ,
//  		 - 	СправочникСсылка.ВебСерверы,
//  		 - 	СправочникСсылка.ХранилищаКонфигураций - Объект информацио о проверке которого записывается
//  		 
//  Правило - СправочникСсылка.ПравилаПроверкиОбъектов - Правило
Процедура ЗаписатьРезультатПроверки(ОбъектКластера, Правило) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектКластера) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.ПроверкиОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Объект	= ОбъектКластера;
	ЗаписьРегистра.Правило	= Правило;
	ЗаписьРегистра.Записать(Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
